{
  "challenges": [
    {
      "id": 1,
      "slug": "calculadora-mobile",
      "title": "Calculadora Mobile",
      "shortDescription": "Aplicativo mobile de uma calculadora.",
      "longDescription": "Você sabia que a calculadora foi inventada em 1642 e passou por grandes mudanças pelo Blaise Pascal? Isso mesmo, Pascal! O matemático que teve como homenagem seu nome em uma linguagem de programação. Com base nisso, desenvolva uma calculadora que tenha as funções básicas (adição, subtração, multiplicação e divisão) e que seja capaz de trabalhar com números decimais.",
      "cover": "https://i.imgur.com/txEiZ71.png",
      "repository": "https://github.com/wavelabss/desafio-calculadora-mobile"
    },
    {
      "id": 2,
      "slug": "notas-mobile",
      "title": "Notas Mobile",
      "shortDescription": "Aplicativo mobile para fazer anotações",
      "longDescription": "Quem nunca precisou anotar algo de última hora ou até mesmo montar um mural com base em suas anotações? Pensando nisso, cola junto e desenvolva um mural de anotações prático para que possa armazenar e remover lembretes de maneira dinâmica! Mas atenção, cuidado para não deixar seu mural confuso!",
      "cover": "https://i.imgur.com/5RdUfYx.png",
      "repository": "https://github.com/wavelabss/desafio-notas-mobile"
    },
    {
      "id": 3,
      "slug": "calendario-mobile",
      "title": "Calendário Mobile",
      "shortDescription": "Aplicativo mobile de um calendario.",
      "longDescription": "Já fez nosso desafio para o mural de anotações? Se não fez, clique aqui e não perca a oportunidade! Além de práticas anotações, precisamos também de nossas agendas para nos organizarmos, não é mesmo? Com base nessa necessidade, crie um calendário no qual seja possível adicionar compromissos/agendas e também definir horários. Além disso, é importante que tenhamos dinâmica para edição e remoção. Afinal, imprevistos acontecem, né?!",
      "cover": "https://i.imgur.com/QX0o7YU.png",
      "repository": "https://github.com/wavelabss/desafio-calendario-mobile"
    },
    {
      "id": 4,
      "slug": "music-player-web",
      "title": "Music Player Web",
      "shortDescription": "Aplicativo web de um music player.",
      "longDescription": "Serviços de streaming estão cada vez mais em alta, não é mesmo? Agora é hora de você ter seu próprio streaming de músicas e podcasts! Crie um player interativo capaz de carregar músicas e álbuns a fim de que possamos dar play/pause quando quisermos! Além disso, é importante que o comportamento da aplicação seja dinâmico com as imagens de cada álbum aparecendo conforme imagem.",
      "cover": "https://i.imgur.com/ZDpPF85.png",
      "repository": "https://github.com/wavelabss/desafio-music-player-web"
    },
    {
      "id": 5,
      "slug": "pomodoro-web",
      "title": "Pomodoro Web",
      "shortDescription": "Aplicativo web de um pomodoro.",
      "longDescription": "Gestão do tempo é importante para que possamos definir prioridades em nossos a fazeres. Logo, a técnica Pomodoro foi desenvolvida no final dos anos 80 para que seu criador pudesse aumentar sua produtividade. Seu uso consiste em turnos de 25 minutos para trabalho intenso - pausas de 5 minutos e, ao final de 4 blocos de trabalho, tem-se uma pausa de 30 minutos. Pensando nisso, desenvolva um Pomodoro para que possa utilizar e tornar-se mais produtivo. O que acha de tentar seguir essa técnica? Tente e nos dê sua avaliação em nosso Discord!",
      "cover": "https://i.imgur.com/M2OToFn.png",
      "repository": "https://github.com/wavelabss/desafio-pomodoro-web"
    },
    {
      "id": 6,
      "slug": "streaming-filme-web",
      "title": "Streaming Filme Web",
      "shortDescription": "Aplicativo web para streaming de filme.",
      "longDescription": "Netflix, Amazon Prime, Disney Plus... Todos estes são aplicativos de streaming para que o público possa assistir filmes e séries pagando um valor mensal à plataforma. O interessante é que podemos acompanhar sinópses, episódios, trailers e muito mais a partir dela. A partir disso, desenvolva uma página web capaz de armazenar imagens e as descrições de filmes/séries. Mas atenção, lembre-se que deverá ter um controle para buscas para nomes e gêneros. Prepare-se! Pegue a pipoca e mãos a obra!",
      "cover": "https://i.imgur.com/7vg3zmW.png",
      "repository": "https://github.com/wavelabss/desafio-streaming-filme-web"
    }
  ]
}
